#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

Show Plan

```terraform
data.azurerm_resource_group.rg-default: Reading...
data.azurerm_resource_group.rg-default: Read complete after 0s [id=/subscriptions/df7ed44c-e98a-43c4-af18-241e33567262/resourceGroups/RG-UmeshPagar]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_update_resource.enable_soft_delete will be created
  + resource "azapi_update_resource" "enable_soft_delete" {
      + body                    = jsonencode(
            {
              + properties = {
                  + policies = {
                      + softDeletePolicy = {
                          + retentionDays = 7
                          + status        = true
                        }
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.ContainerRegistry/registries@2023-01-01-preview"
    }

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "acractionseastus"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "RG-UmeshPagar"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "created_by"  = "Terraform"
          + "environment" = "dev"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-eastus"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "aks-eastus"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "RG-UmeshPagar"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_role_assignment.acr_pull will be created
  + resource "azurerm_role_assignment" "acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.acr_identity will be created
  + resource "azurerm_user_assigned_identity" "acr_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "acr-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "RG-UmeshPagar"
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.aks_identity will be created
  + resource "azurerm_user_assigned_identity" "aks_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "aks-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "RG-UmeshPagar"
      + tenant_id           = (known after apply)
    }

  # module.virtual_network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = [
          + "8.8.8.8",
          + "8.8.4.4",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vn-test-dev"
      + resource_group_name = "RG-UmeshPagar"
      + subnet              = [
          + {
              + address_prefix = "10.1.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
                # (1 unchanged attribute hidden)
            },
          + {
              + address_prefix = "10.1.2.0/24"
              + id             = (known after apply)
              + name           = "subnet2"
                # (1 unchanged attribute hidden)
            },
          + {
              + address_prefix = "10.1.3.0/24"
              + id             = (known after apply)
              + name           = "subnet3"
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "created_by"  = "Terraform"
          + "environment" = "dev"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```



*Pusher: @Umesh-Pagar, Action: `pull_request`, Workflow: `Pull Request Main`*